InformationRegisters/СтатусыЗаявокНаПриобретениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаявокНаПриобретениеПаев</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаПайщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыЗаявокНаПриобретениеПаев/Ext/ManagerModule.bsl
Процедура УстановитьСтатусЗаявкиНаПриобретениеПаев(Организация, ЗаявкаПайщика, НовыйСтатус, Период, Отказ = Ложь) Экспорт
	
	Попытка
		
		Блокировка				= Новый БлокировкаДанных;
		ЭлементБлокировки		= Блокировка.Добавить(Метаданные.РегистрыСведений.СтатусыЗаявокНаПриобретениеПаев.ПолноеИмя());
		ЭлементБлокировки.Режим	= РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.УстановитьЗначение("Организация", 	Организация);
		ЭлементБлокировки.УстановитьЗначение("ЗаявкаПайщика",	ЗаявкаПайщика);
		                        
		Блокировка.Заблокировать();
        		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗаявокНаПриобретениеПаевСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыЗаявокНаПриобретениеПаев.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ЗаявкаПайщика = &ЗаявкаПайщика) КАК СтатусыЗаявокНаПриобретениеПаевСрезПоследних");
			
		Запрос.УстановитьПараметр("Период",			Период);
		Запрос.УстановитьПараметр("ЗаявкаПайщика",	ЗаявкаПайщика);
		Запрос.УстановитьПараметр("Организация", 	Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		// Проверяем текущий статус
		Если Выборка.Следующий() Тогда
			Если Выборка.Статус = НовыйСтатус Тогда
				Возврат;
			ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявокПайщиков.Принята Тогда
				// Это конечный статус, его не меняем
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Запрещено изменять статус '%1' документа %2", Выборка.Статус, ЗаявкаПайщика), ЗаявкаПайщика,,, Отказ);
				Возврат;		
			КонецЕсли;
		КонецЕсли;
				
		МенеджерЗаписи					= РегистрыСведений.СтатусыЗаявокНаПриобретениеПаев.СоздатьМенеджерЗаписи();
	    МенеджерЗаписи.Период			= Период;
		МенеджерЗаписи.Организация		= Организация;
		МенеджерЗаписи.ЗаявкаПайщика	= ЗаявкаПайщика;
		МенеджерЗаписи.Статус			= НовыйСтатус;
		
		МенеджерЗаписи.Записать(Истина);
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ЗаявкаПайщика,,, Отказ);
	КонецПопытки;	
		
КонецПроцедуры
